
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДоступностьДлительности();

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Объект.Бессрочно И Объект.ДлительностьВМинутах	= 0 Тогда	
		Отказ	= Истина;
		Сообщить("Поле ""Длительность"" не заполнено");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура БессрочноПриИзменении(Элемент)
	
	ОбновитьДоступностьДлительности();	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьДлительности()
	
	Элементы.ДлительностьВМинутах.ТолькоПросмотр	= Объект.Бессрочно;
	
	Если Объект.Бессрочно Тогда	
		Объект.ДлительностьВМинутах	= 0;	
	КонецЕсли;
	
КонецПроцедуры	


